'use client';
import { useState } from 'react';
import styles from './description.module.scss';
import RegularButton from '@/ui/RegularButton';

export default function DescriptionSection() {

    const [isExpanded, setIsExpanded] = useState<boolean>(false);

    return (
        <div className={styles.descriptionWrapper}>
            <div className={!isExpanded ? styles.amore : styles.amoreDisabled}>
                <h2 className={styles.mainCaption}>Привіт, особлива техніко!</h2>
                <p className={styles.descriptionParagraph}>Ми розпочали свій шлях на українському ринку ще в далекому 2014-му році. За такий тривалий час нам вдалось сформувати команду професійних продавців-консультантів та висококласних сервісних інженерів. А також круту ком’юніті постійних клієнтів та партнерів.</p>
                <p className={styles.descriptionParagraph}>Ми цінуємо вашу довіру, тому завжди готові допомогти, надати консультацію чи пораду щодо покупки. Клієнти — це перш за все наші друзі. І, як відомо, для друзів лише все найкраще!</p>
                {isExpanded && (
                    <>
                        <h2 className={styles.secondaryCaption}>Чому саме ябко?</h2>
                        <p className={styles.descriptionParagraph}>Купувати техніку та аксесуари в Ябко — максимально просто, вигідно, зручно та безпечно. У нас тисячі задоволених клієнтів по всій Україні та безліч відгуків на різних платформах. Ми гарантуємо висококласний рівень обслуговування та лише позитивні емоції від покупок.</p>
                        <p className={styles.descriptionParagraph}>Усе, що ви бачите на полицях наших магазинів та у каталозі сайту — гарантовано 100% оригінальний якісний продукт від популярних брендів. Якщо вам треба придбати, обміняти, відремонтувати, доповнити аксесуарами будь-що із техніки — вам до нас!</p>
                        <p className={styles.descriptionParagraph}>Ябко — це ідеальне місце, де ви завжди можете придбати:</p>
                        <p className={styles.descriptionParagraph}>
                        — Флагманські смартфони iPhone.<br/>
                        — Професійні планшети iPad.<br/>
                        — Потужні ноутбуки MacBook.<br/>
                        — Розумні годинники Apple Watch.<br/>
                        — Безпровідні навушники AirPods.<br/>
                        — Оригінальні аксесуари від Apple.<br/>
                        — Ігрові ноутбуки від популярних брендів.<br/>
                        </p>
                        <p className={styles.descriptionParagraph}>Ми знайдемо для вас саме ту бажану модель з потрібним кольором, обсягом пам’яті за вигідною вартістю та з гарантією на техніку. Для вашого комфорту і безпеки — одразу «запакуємо» обновку в оригінальний чохол, поклеїмо захисне скло або плівку, підберемо павербанк. Все для абсолютної впевненості у тому, що ви отримаєте задоволення від техніки на всі 100%.</p>
                        <p className={styles.descriptionParagraph}>Також ми намагаємось розширювати «технічний світогляд» наших клієнтів і постійно шукаємо для Ябко найкращі новинки цифрової техніки: у нас можна придбати акустичні системи Apple, Harman Kardon, JBL, Marshall, ігрові приставки Playstation та екшн-камери GoPro, спортивні годинники Garmin та ще безліч високоякісних гаджетів і аксесуарів для них.</p>
                        <p className={styles.descriptionParagraph}>У вересні 2024 року ми побачили традиційну презентацію флагманських смартфонів Apple: iPhone 16 Pro Max, iPhone 16, iPhone 16 Pro, iPhone 16 Plus. Як і очікувалось, нові Айфони 2024 року отримали не лише удосконалений дизайн у нових кольорах, а й нові варіанти потужних процесорів A18 та операційну систему iOS18.</p>
                        <p className={styles.descriptionParagraph}>Кінець зими та весна 2025 року принесли фанатам не лише новий iPhone 16e, а й вагоме оновлення лінійки планшетів Apple iPad 11 2025, а також легкі, потужні та зручні Епл Айпад Ейр 11 М3 2025 та Apple iPad Air 13 M3 2025.</p>
                        <h2 className={styles.mainCaption}>Запорука безпеки — Гарантія від Ябко</h2>
                        <p className={styles.descriptionParagraph}>На весь асортимент техніки Apple ми надаємо гарантію від виробника та від магазину Ябко, яка розповсюджується як на нові, так і на вживані пристрої. Для тих, хто вважає, що обмежувати себе в якісному сервісі не варто — ми можемо розширити будь-яку гарантію, а також додати до неї приємні переваги та бонуси.</p>
                        <p className={styles.descriptionParagraph}>Флагманські смартфони та планшети добре відомі своїми розкішними безрамковими дисплеями, які так ваблять яскравими кольорами. Та жоден дисплей не захищений від нещасного випадку — тому ми рекомендуємо заздалегідь подбати про них та придбати “Гарантію на розбиття”.</p>
                        <p className={styles.descriptionParagraph}>Це не просто допоможе продовжити життя пристрою та повернути дисплей у робочий стан, якщо ви ненароком пошкодили або повністю розбили його. Ми у найкоротші терміни проводимо заміну екрана на оригінальний новий варіант, який знову тішитиме вас яскравим та деталізованим зображенням. Така послуга — це ще й гарантія вашого спокою, комфорту і безпеки. Більше жодних турбот, адже команда Ябко тримає все під контролем.</p>
                        <p className={styles.descriptionParagraph}>Як створити обліковий запис Apple ID? Як скачати програму з AppStore на iPhone? У Ябко можна налаштувати пристрій для повноцінно комфортного користування смартфоном, планшетом чи ноутбуком з перших хвилин після покупки. Також ми допоможемо встановити фірмовий пакет базових програм для будь-якої техніки. В асортименті доступні додатки для фінансів, бізнесу, навчання, спорту, найкращі ігри та розважальні програми.</p>
                        <h2 className={styles.mainCaption}>Доступні покупки — Trade IN в Ябко</h2>
                        <p className={styles.descriptionParagraph}>Продавати старий девайс лише для того, аби придбати новий? Забудьте про це, адже існує програма обміну Trade In від Ябко! Вам більше не потрібно думати про те, де взяти кошти на новий смартфон. Завдяки Trade In ви зможете обміняти старий гаджет на бажану флагманську модель лише з доплатою різниці у вартості.</p>
                        <p className={styles.descriptionParagraph}>Така послуга дозволяє швидко та вигідно обміняти свій пристрій на новий або вживаний, але новішої моделі. При цьому можна здійснити оплату сумою вашого пристрою до 99% вартості нового.</p>
                        <p className={styles.descriptionParagraph}>З обміном техніки у Ябко ви заощаджуєте і час, і гроші: до 35% на покупці нового девайсу. До того ж при обміні Trade In мережа магазинів Ябко дає 100% гарантію, що це буде оригінальна продукція Apple. Разом з новим пристроєм ви отримаєте повний пакет відповідних документів: товарний чек та гарантійний талон.</p>
                        <p className={styles.descriptionParagraph}>Особливо актуальна пропозиція для користувачів, які хочуть купити найновіший смартфон. Адже на початку вересня 2024 року — очікується Apple Event на якому покажуть базову лінійку Айфон 16, а також флагманські варіанти Айфон 16 Про і Айфон 16 Про Макс. Цілком можливо, що розробники трохи доопрацюють нову лінійку і розширять модельний ряд, додавши новий Айфон 16 Плюс.</p>
                        <h2 className={styles.mainCaption}>Якісний ремонт — Сервісний Центр Ябко</h2>
                        <p className={styles.descriptionParagraph}>Швидкий ремонт, компетентна техпідтримка, реанімація улюбленого смартфона — кваліфіковані сервісні інженери у Ябко не знають слова “неможливо”.</p>
                        <p className={styles.descriptionParagraph}>Наші майстри мають великий досвід у вирішенні різноманітних технічних складнощів. Розбите скло, несправні динаміки, білий екран — ми відремонтуємо усе. При цьому, уся робота буде виконана з допомогою сучасного обладнання та використанням оригінальних компонентів Apple.</p>
                        <p className={styles.descriptionParagraph}>Потрібна консультація щодо ремонту? Менеджери завжди вислухають вас та допоможуть, а сервісні інженери – розгадають найскладніший ребус-ремонт. Якщо потрібно, на час проведення гарантійного ремонту ми надамо пристрій на заміну, щоб ви не почувались без нього, як без рук.</p>
                        <h2 className={styles.mainCaption}>Завжди на зв’язку — інтернет-магазин Ябко</h2>
                        <p className={styles.descriptionParagraph}>Де б ви не були — наша команда завжди на зв’язку. Ми довго працювали над створенням зручного сайту. І тепер ви можете легко оформити замовлення у два кліки, а забрати — у зручному пункті видачі.</p>
                        <p className={styles.descriptionParagraph}>Знайти найближчий до вас магазин мережі можна за допомогою карти на сторінці “Контакти”. Отримати консультацію щодо ремонту та залишити заявку — максимально просто у розділі “Ремонт”. Вирішили швидко обміняти старий гаджет на новий? Вам на сторінку Trade IN!</p>
                        <p className={styles.descriptionParagraph}>Якщо у вас виникли питання щодо графіка роботи чи наявності товару у вашому місті — напишіть у чат на сайті або залиште прохання зателефонувати. У найкоротші терміни наші консультанти нададуть вам відповідь. До зустрічі у Ябко!</p>
                    </>
                )}
            </div>
            {!isExpanded && (
                <div className={styles.buttonWrapper}>
                    <RegularButton
                        onClick={() => setIsExpanded(!isExpanded)}
                        title="Читати далi"
                    />
                </div>
            )}
        </div>
    )
}